# Spark SQL with PySpark
**Objective**

Learn how to use Spark SQL in PySpark to perform data manipulation and analysis on structured data.

## Setup Instructions

In [1]:
!pip install pyspark

Requirement already satisfied: pyspark in /home/rnd/hieng/venv/lib/python3.12/site-packages (3.5.5)
Requirement already satisfied: py4j==0.10.9.7 in /home/rnd/hieng/venv/lib/python3.12/site-packages (from pyspark) (0.10.9.7)

In [1]:
from pyspark.sql import SparkSession

# Initialize Spark session
spark = SparkSession.builder \
    .appName("SparkSQLLab") \
    .getOrCreate()

25/04/28 02:59:42 WARN Utils: Your hostname, vishnu resolves to a loopback address: 127.0.1.1; using 103.16.62.251 instead (on interface eno8303)
25/04/28 02:59:42 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
25/04/28 02:59:43 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

In [2]:
# Load JSON data into a DataFrame
# DOES NOT WORK IN COLAB
# employees_df = spark.read.json("./employees.json")
# departments_df = spark.read.json("./departments.json")

In [3]:
# Read JSON file into Python Dict
import json
with open("./employees.json") as f:
    employees = json.load(f)
with open("./departments.json") as f:
    departments = json.load(f)
# Create DataFrames from the loaded data
employees_df = spark.createDataFrame(employees)
departments_df = spark.createDataFrame(departments)

In [4]:
# Create temporary views for SQL queries
employees_df.createOrReplaceTempView("employees")
departments_df.createOrReplaceTempView("departments")

In [5]:
employees_df.show()

+-------+---+-------+------+
|dept_id| id|   name|salary|
+-------+---+-------+------+
|    101|  1|  Alice| 60000|
|    102|  2|    Bob| 70000|
|    103|  3|Charlie| 80000|
|    104|  4|  David| 90000|
|    105|  5|    Eve|100000|
|    106|  6|  Frank|110000|
|    107|  7|  Grace|120000|
|    108|  8|  Heidi|130000|
|    109|  9|   Ivan|140000|
|    110| 10|   Judy|150000|
|    101| 11|   Karl|160000|
|    102| 12|    Leo|170000|
|    103| 13|Mallory|180000|
|    104| 14|   Nina|190000|
|    105| 15|  Oscar|200000|
|    106| 16|  Peggy|210000|
|    107| 17|Quentin|220000|
|    108| 18| Rupert|230000|
|    109| 19|  Sybil|240000|
|    110| 20|  Trent|250000|
+-------+---+-------+------+
only showing top 20 rows

## Lab Tasks
### Task 1: Basic Selection

In [6]:
# SQL query to select all employ
empl = spark.sql("SELECT * FROM employees")
empl.show()

+-------+---+-------+------+
|dept_id| id|   name|salary|
+-------+---+-------+------+
|    101|  1|  Alice| 60000|
|    102|  2|    Bob| 70000|
|    103|  3|Charlie| 80000|
|    104|  4|  David| 90000|
|    105|  5|    Eve|100000|
|    106|  6|  Frank|110000|
|    107|  7|  Grace|120000|
|    108|  8|  Heidi|130000|
|    109|  9|   Ivan|140000|
|    110| 10|   Judy|150000|
|    101| 11|   Karl|160000|
|    102| 12|    Leo|170000|
|    103| 13|Mallory|180000|
|    104| 14|   Nina|190000|
|    105| 15|  Oscar|200000|
|    106| 16|  Peggy|210000|
|    107| 17|Quentin|220000|
|    108| 18| Rupert|230000|
|    109| 19|  Sybil|240000|
|    110| 20|  Trent|250000|
+-------+---+-------+------+
only showing top 20 rows

### Task 2: Filtering

In [11]:
# Write a query to find employees with a salary greater than 100,000.
high_salary_employees = spark.sql("SELECT * FROM employees WHERE salary > 300000")
print(high_salary_employees.count())  # Count the number of high salary employees
high_salary_employees.show()

27
+-------+---+-------+------+
|dept_id| id|   name|salary|
+-------+---+-------+------+
|    106| 26|   Zane|310000|
|    107| 27|  Aaron|320000|
|    108| 28|  Bella|330000|
|    109| 29|  Cathy|340000|
|    110| 30|  Derek|350000|
|    101| 31|  Ethan|360000|
|    102| 32|  Fiona|370000|
|    103| 33| George|380000|
|    104| 34| Hannah|390000|
|    105| 35|    Ian|400000|
|    106| 36|Jasmine|410000|
|    107| 37|  Kevin|420000|
|    108| 38|  Laura|430000|
|    109| 39|   Mike|440000|
|    110| 40|   Nina|450000|
|    101| 41|  Oscar|460000|
|    102| 42|   Paul|470000|
|    103| 43|  Quinn|480000|
|    104| 44| Rachel|490000|
|    105| 45|  Steve|500000|
+-------+---+-------+------+
only showing top 20 rows

### Task 3: Aggregation

In [12]:
# Write a query to calculate the average salary per department (dept_id).
avg_salary_per_dept = spark.sql("""
    SELECT dept_id, AVG(salary) AS avg_salary
    FROM employees
    GROUP BY dept_id
""")
avg_salary_per_dept.show()

+-------+----------+
|dept_id|avg_salary|
+-------+----------+
|    101|  310000.0|
|    102|  320000.0|
|    103|  280000.0|
|    104|  290000.0|
|    105|  300000.0|
|    106|  310000.0|
|    107|  320000.0|
|    108|  330000.0|
|    109|  340000.0|
|    110|  350000.0|
+-------+----------+

### Task 4: Join

In [19]:
# Write a query to join the employees and departments tables and display the employee name, department name, and salary.
join_query = """
SELECT e.name AS employee_name, d.dept_name AS department_name, e.salary 
FROM employees e 
JOIN departments d 
ON e.dept_id = d.dept_id
"""
joined_df = spark.sql(join_query)
joined_df.show()

+-------------+---------------+------+
|employee_name|department_name|salary|
+-------------+---------------+------+
|        Alice|             HR| 60000|
|         Karl|             HR|160000|
|          Uma|             HR|260000|
|        Ethan|             HR|360000|
|        Oscar|             HR|460000|
|       Yvonne|             HR|560000|
|          Bob|    Engineering| 70000|
|          Leo|    Engineering|170000|
|       Victor|    Engineering|270000|
|        Fiona|    Engineering|370000|
|         Paul|    Engineering|470000|
|         Zach|    Engineering|570000|
|      Charlie|      Marketing| 80000|
|      Mallory|      Marketing|180000|
|       Walter|      Marketing|280000|
|       George|      Marketing|380000|
|        Quinn|      Marketing|480000|
|        David|        Finance| 90000|
|         Nina|        Finance|190000|
|         Xena|        Finance|290000|
+-------------+---------------+------+
only showing top 20 rows

### Task 5: Complex Query

In [22]:
# Write a query to find the department(s) with the highest average salary. 
# Use a subquery or common table expression (CTE).
highest_avg_salary_query = """
WITH avg_salaries AS (
    SELECT dept_id, AVG(salary) AS avg_salary
    FROM employees
    GROUP BY dept_id
)
SELECT d.dept_name, a.avg_salary
FROM avg_salaries a
JOIN departments d
ON a.dept_id = d.dept_id
WHERE a.avg_salary = (SELECT MAX(avg_salary) FROM avg_salaries)
"""
highest_avg_salary_df = spark.sql(highest_avg_salary_query)
highest_avg_salary_df.show()

+---------+----------+
|dept_name|avg_salary|
+---------+----------+
|    Admin|  350000.0|
+---------+----------+

### Clean Up

In [7]:
# spark.stop()

## (My) Key Takeaway
From this Lab practice, Spark SQL, I have learned that Spark SQL provides a powerfull interface for querying structured data using SQL syntax within PySpark. It allows us to create temporary views from DataFrames and perform operations like selection, filtering, aggregation, and joins efficiently. We also explored how to use Spark SQL for complex queries, such as finding departments with the highest average salary using subqueries or CTEs. Overall, Spark SQL simplifies data manipulation and analysis on large datasets.